In [31]:
import seaborn as sns
titanic = sns.load_dataset('titanic')
import pandas as pd
import numpy as np

titanic.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [53]:
# 설정 변경 코드
# 변수 명이 두번 이상 출력되어도 모두 콘솔에서 보여줄 것
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

# InteractiveShell.ast_node_interactivity : 'all' | 'last' | 'last_expr' | 'none' (기본값은 'last_expr')

### 연습문제 

1. 타이타닉 데이터에서 승객의 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive)인원수를 구하시오.

2. 성별 인원수는 인덱스 기준으로 정렬하고, 나이별 인원수는 값 기준으로 정렬하며, 나머지는 임의 기준으로 선정하여 정렬 하시오.

In [23]:
# 타이타닉 승객에 대하여 성별 인원수 구하기
titanic['sex'].value_counts().sort_index()

female    314
male      577
Name: sex, dtype: int64

In [25]:
# 타이타닉 승객에 대하여 나이별 인원수 구하기
titanic['age'].value_counts().sort_values()

74.00     1
34.50     1
0.42      1
0.67      1
66.00     1
         ..
28.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [27]:
# 타이타닉 승객에 대하여 선실별 인원수 구하기
#파이썬에서는 형태 분류 class로 작업

titanic['class'].value_counts().sort_index(ascending = False)

Third     491
Second    184
First     216
Name: class, dtype: int64

In [32]:
#타이타닉 승객에 대하여 사망/생존 인원수 구하기
pd.value_counts(titanic['alive'])

no     549
yes    342
Name: alive, dtype: int64

In [34]:
#타이타닉 승객에 대하여 사망/생존 인원수 구하기
#.연산자 이용해서 data에 접근
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

---

### 연습문제 : 수치형-> 범주형 데이터 생성

: 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고(alive), 각 그룹에 대해 미성년자, 청년, 중년, 장년, 노년 승객의 비율을 구하시오.

- bins=[1,15,25,35,60,99]
- labels=['미성년자','청년','중년','장년','노년']
- 각 그룹별 비율의 전체 합은 1이 되어야 한다.

**타이타닉 데이터셋 로딩**

In [35]:
# 타이타닉 승객 dataset 읽어오기
import seaborn as sns 
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**데이터 셋 분리 : 생존자 그룹과 사망자 그룹**

In [42]:
# 사망자 그룹 데이터 프레임 추출
titanic[titanic['alive'] == 'no'].count()
df_death = titanic[titanic['alive'] == 'no']
df_death.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False

In [43]:
# 생존자 그룹 데이터 프레임 추출
titanic[titanic['alive'] == 'yes'].count()
df_alive = titanic[titanic['alive'] == 'yes']
df_alive.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

**데이터 범위 설정**

In [40]:
# 라벨과 범위 간격 설정
bins=[1,15,25,35,60,99]
labels=['미성년자','청년','중년','장년','노년']

In [54]:
# 범위 유효성 검사
# bins=[1,15,25,35,60,99]

#제시된 bins의 최초값 1 이하인 값 1.0과 0.42가 각
#그룹의 최소나이로 확인되므로 bins 수정
#최대나이는 74와 80으로 확인되어서 수정 필요 없음

df_death['age'].min()
df_death['age'].max()

df_alive['age'].min()
df_alive['age'].max()

bins=[0,15,25,35,60,99]

1.0

74.0

0.42

80.0

In [55]:
# Warning 표시 안하도록 설정
import warnings
warnings.filterwarnings('ignore')

**범주형 데이터 생성**

In [56]:
# 카테고리 데이터 생성
cat_death= pd.cut(df_death['age'], bins, labels=labels)
cat_death
cat_alive= pd.cut(df_alive['age'], bins, labels=labels)
cat_alive

0        청년
4        중년
5       NaN
6        장년
7      미성년자
       ...
884      청년
885      장년
886      중년
888     NaN
890      중년
Name: age, Length: 549, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

1        장년
2        중년
3        중년
8        중년
9      미성년자
       ...
875    미성년자
879      장년
880      청년
887      청년
889      중년
Name: age, Length: 342, dtype: category
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

**범주형 데이터 확인**

In [57]:
#카테고리 데이터 확인
df_death['age_cut'] = cat_death
df_death.head()
df_alive['age_cut'] = cat_alive
df_alive.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_cut
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,청년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,중년
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,NaN
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,장년
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,미성년자

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_cut
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,장년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,중년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,중년
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,중년
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,미성년자

**범주형 데이터 빈도 계산**

- 사망자 그룹의 연령대별 승객수

In [73]:
# 카테고리 데이터들의 빈도 수 계산
pd.value_counts(df_death['age_cut'])

# 사망자그룹 계산
df_death['age_cut'].count()

청년      143
장년      117
중년      113
미성년자     34
노년       17
Name: age_cut, dtype: int64

424

- 사망자 그룹의 연령대별 빈도

In [74]:
# 각 연령대별 승객수의 비율 계산
pd.value_counts(df_death['age_cut'],normalize=1)

# 전체 비율의 합 계산
pd.value_counts(df_death['age_cut'],normalize=1).sum()

청년      0.337264
장년      0.275943
중년      0.266509
미성년자    0.080189
노년      0.040094
Name: age_cut, dtype: float64

1.0

- 생존자 그룹 빈도

In [75]:
# 카테고리 데이터들의 빈도 수 계산
pd.value_counts(df_alive['age_cut'])

# 생존자비율 계산
df_alive['age_cut'].count()

중년      83
장년      78
청년      75
미성년자    49
노년       5
Name: age_cut, dtype: int64

290

- 생존자 그룹의 연령대별 빈도

In [76]:

# 각 연령대별 승객수의 비율 계산
pd.value_counts(df_alive['age_cut'],normalize=1)

# 전체 비율의 합 계산
pd.value_counts(df_alive['age_cut'],normalize=1).sum()

중년      0.286207
장년      0.268966
청년      0.258621
미성년자    0.168966
노년      0.017241
Name: age_cut, dtype: float64

1.0

------------------------